using System;

namespace Kogane
{
    /// <summary>
    /// コマンドライン引数からオプションを受け取る時の名前を管理する属性
    /// </summary>
    public sealed class OptionAttribute : Attribute
    {
        //================================================================================
        // プロパティ
        //================================================================================
        public string Name { get; } // ハイフン無しのオプション名

        //================================================================================
        // 関数
        //================================================================================
        /// <summary>
        /// コンストラクタ
        /// </summary>
        /// <param name="name">ハイフン無しのオプション名</param>
        public OptionAttribute( string name )
        {
            Name = name;
        }
    }
}